lim3ra/esp32flight/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# 16MB quad flash, octal PSRAM (ESP32-S3-WROOM-1 N16R8)
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_RODATA=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# RGB LCD needs iram-safe flash ops while bounce buffers run
CONFIG_LCD_RGB_ISR_IRAM_SAFE=y
CONFIG_LCD_RGB_RESTART_IN_VSYNC=n

# Display port (Waveshare demo defaults)
CONFIG_EXAMPLE_LVGL_PORT_TASK_CORE=1
CONFIG_EXAMPLE_LVGL_PORT_AVOID_TEAR_ENABLE=y

# LVGL v8
CONFIG_LV_MEM_CUSTOM=y
CONFIG_LV_MEMCPY_MEMSET_STD=y
CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM=y
CONFIG_LV_USE_PNG=y
CONFIG_LV_USE_SJPG=y
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_32=y
CONFIG_LV_USE_FONT_COMPRESSED=y

# Networking
CONFIG_ESP_TLS_INSECURE=n
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
# Several concurrent TLS sessions (API + tiles + integrations): shrink
# per-connection RAM or ssl_setup starts failing with alloc errors
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CONFIG_DATA=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CA_CERT=y
# TLS buffers go to PSRAM: internal heap is too tight for several sessions
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_SPIFFS_OBJ_NAME_LEN=48

CONFIG_LV_MEM_CUSTOM_INCLUDE="esp_heap_caps.h"

# The device runs out of socket descriptors at the stock 10. Proven from the
# board's own log: "httpd_server: error accepting new connection" alongside
# "esp-tls: Failed to create socket", 14 times in one session - the panel
# stops answering while MQTT, which already holds its socket, keeps
# publishing, which is exactly how the failure looks from outside.
#
# The pool is shared: 4 for the web panel, 1 for MQTT, and the rest for the
# app's own outbound TLS - tiles, logos, routes, airspace, per-airport
# timezone lookups, weather. That last group bursts.
#
# 16 was tried once before and reverted: it cost ~3.5 KB of internal RAM,
# which back then took the minimum free down to 716 B. Since the screensaver,
# world map and detail panel came out, the internal minimum sits at 30-40 KB,
# so the same 3.5 KB is now affordable.
CONFIG_LWIP_MAX_SOCKETS=16
